Catalogs/тсВидыПечатныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>тсВидыПечатныхДокументов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СклеиватьВОдинФайл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрыватьПослеФормирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ШаблоныПечатныхФорм</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ШаблонПечатнойФормы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.тсШаблоныПечатныхДокументов</v8:Type>
								<v8:Type>cfg:CatalogRef.КомплектыФайловДляПечати</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФункцияСвойств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФункцииСвойств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФункцияКоличество</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФункцииСвойств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходящийНомер</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прикреплять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/тсВидыПечатныхДокументов/Forms/ФормаЭлементаУпр/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не Объект.Назначение = "" Тогда
		Назначение = УЭДСервер.ПолучитьТипИзСтроки(Объект.Назначение);
		мсТекущийТип = Новый Массив;
		мсТекущийТип.Добавить(Назначение);
		ЭтаФорма.ДопустимыеТипы = Новый ОписаниеТипов(мсТекущийТип);
	КонецЕсли;
	Элементы.ШаблоныПечатныхФормИсходящийНомер.Видимость = ОбъектыСервер.ПолучитьЗначениеКонстанты("АвторегистрацияПечатныхФорм") И Не Объект.СклеиватьВОдинФайл;
	Элементы.ШаблоныПечатныхФормПрикреплять.Видимость = Не Объект.СклеиватьВОдинФайл;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Назначение = Строка(ДопустимыеТипы);
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныПечатныхФормПрикреплятьПриИзменении(Элемент)
	Если ТипЗнч(Элементы.ШаблоныПечатныхФорм.ТекущиеДанные.ШаблонПечатнойФормы) = Тип("СправочникСсылка.тсШаблоныПечатныхДокументов") Тогда
		Если Не Элементы.ШаблоныПечатныхФорм.ТекущиеДанные.Прикреплять Тогда
			Элементы.ШаблоныПечатныхФорм.ТекущиеДанные.ИсходящийНомер = Ложь;
		КонецЕсли;
	Иначе
		Элементы.ШаблоныПечатныхФорм.ТекущиеДанные.Прикреплять = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныПечатныхФормИсходящийНомерПриИзменении(Элемент)
	Если ТипЗнч(Элементы.ШаблоныПечатныхФорм.ТекущиеДанные.ШаблонПечатнойФормы) = Тип("СправочникСсылка.тсШаблоныПечатныхДокументов") Тогда
		Если Элементы.ШаблоныПечатныхФорм.ТекущиеДанные.ИсходящийНомер Тогда
			Элементы.ШаблоныПечатныхФорм.ТекущиеДанные.Прикреплять = Истина;
		КонецЕсли;
	Иначе
		Элементы.ШаблоныПечатныхФорм.ТекущиеДанные.ИсходящийНомер = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныПечатныхФормШаблонПечатнойФормыПриИзменении(Элемент)
	Если ТипЗнч(Элементы.ШаблоныПечатныхФорм.ТекущиеДанные.ШаблонПечатнойФормы) <> Тип("СправочникСсылка.тсШаблоныПечатныхДокументов") Тогда
		Элементы.ШаблоныПечатныхФорм.ТекущиеДанные.ИсходящийНомер = Ложь;
		Элементы.ШаблоныПечатныхФорм.ТекущиеДанные.Прикреплять = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СклеиватьВОдинФайлПриИзменении(Элемент)
	Для Каждого Эл Из Объект.ШаблоныПечатныхФорм Цикл
		Эл.Прикреплять = Ложь;
		Эл.ИсходящийНомер = Ложь;
	КонецЦикла;
	Элементы.ШаблоныПечатныхФормИсходящийНомер.Видимость = ОбъектыСервер.ПолучитьЗначениеКонстанты("АвторегистрацияПечатныхФорм") И Не Объект.СклеиватьВОдинФайл;
	Элементы.ШаблоныПечатныхФормПрикреплять.Видимость = Не Объект.СклеиватьВОдинФайл;
КонецПроцедуры
